Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `invoke` method is synchronous. Sometimes you need to execute an asynchronous action. In this case use `call`, as in: `onItem().call(item -> someAsyncAction(item))`. Note that `call` does not change the item, it just calls an asynchronous action, and when this one completes, it emits the original item downstream.
ja_jp: `invoke` メソッドは同期型です。時には、非同期のアクションを実行する必要があります。このような場合は `call` を使用して、 `onItem().call(item → someAsyncAction(item))` のようにします。なお、 `call` はアイテムを変更するのではなく、非同期アクションを呼び出すだけで、このアクションが完了すると、元のアイテムを下流に放出します。

source: The `io.quarkus.builder.item.BuildItem` concept represents object instances you will produce or consume (and at some point convert into bytecode) thanks to methods annotated with `@io.quarkus.deployment.annotations.BuildStep` which describe your extension's deployment tasks.
ja_jp: `io.quarkus.builder.item.BuildItem` の概念は、 `@io.quarkus.deployment.annotations.BuildStep` でアノテーションされたメソッドのおかげで、生成または消費 (そしてある時点でバイトコードに変換したり) するオブジェクトインスタンスを表しています。このアノテーションは、エクステンションのデプロイメントタスクを説明しています。

source: The `io.quarkus.extension` plugin will be used in order to help us building the extension. The plugin will *only* be applied to the `runtime` module.
ja_jp: `io.quarkus.extension` プラグインは、エクステンションをビルドするために使用されます。このプラグインは、 `runtime` モジュールに *のみ* 適用されます。

source: The `io.quarkus.logging.Log` class contains the same methods as JBoss Logging, except that they are `static`.
ja_jp: `io.quarkus.logging.Log` クラスには、 `static` であることを除き、JBoss Logging と同じメソッドがあります。

source: The `io.quarkus.logging.Log` class mirrors the JBoss Logging API, except all methods are `static`.
ja_jp: `io.quarkus.logging.Log` クラスは、すべてのメソッドが `static` であることを除き、JBoss Logging API をミラーリングします。

source: The `io.quarkus.mongodb.ReactiveMongoClient` client is deprecated and will be removed in the future. It is recommended to switch to the `io.quarkus.mongodb.reactive.ReactiveMongoClient` client providing the `Mutiny` API.
ja_jp: `io.quarkus.mongodb.ReactiveMongoClient` クライアントは非推奨であり、将来的には削除される予定です。 `Mutiny` API を提供する `io.quarkus.mongodb.reactive.ReactiveMongoClient` クライアントに切り替えることをお勧めします。

source: The `io.quarkus.oidc.AuthenticationContext` annotation can also be used to enforce required authentication level for a WebSockets Next server endpoint. The annotation must be placed on the endpoint class, because the `SecurityIdentity` is created before the HTTP connection is upgraded to a WebSocket connection. For more information about the HTTP upgrade security, see the xref:websockets-next-reference.adoc#secure-http-upgrade[Secure HTTP upgrade] section of the Quarkus "WebSockets Next reference" guide.
ja_jp: `io.quarkus.oidc.AuthenticationContext` アノテーションは、WebSockets Next サーバーエンドポイントに必要な認証レベルを適用するためにも使用できます。`SecurityIdentity` は、HTTP 接続が WebSocket 接続にアップグレードされる前に作成されるため、アノテーションはエンドポイントクラスに配置する必要があります。HTTP アップグレードのセキュリティに関する詳細については、Quarkus の「WebSockets Next reference」ガイドの xref:websockets-next-reference.adoc#secure-http-upgrade[セキュアな HTTP アップグレード] セクションを参照してください。

source: The `io.quarkus.oidc.AuthenticationContext` annotation can be used to list one or more Authentication Context Class Reference (ACR) values to enforce a required authentication level for the Jakarta REST resource classes and methods. The https://datatracker.ietf.org/doc/rfc9470/[OAuth 2.0 Step Up Authentication Challenge Protocol] introduces a mechanism for resource servers to request stronger authentication methods when the token does not have expected Authentication Context Class Reference (ACR) values. Consider the following example:
ja_jp: `io.quarkus.oidc.AuthenticationContext` アノテーション は、Jakarta REST リソースクラスとメソッドに必要な認証レベルを適用するために、1 つ以上の Authentication Context Class Reference (ACR) 値をリストするために使用できます。 https://datatracker.ietf.org/doc/rfc9470/[OAuth 2.0 Step Up Authentication Challenge Protocol] は、トークンに予期される Authentication Context Class Reference (ACR) 値がない場合に、リソースサーバーがより強力な認証メソッドを要求するためのメカニズムを導入しています。 次の例を考えます。

source: The `io.quarkus.oidc.Tenant` annotation can be used to select tenant for a WebSockets Next server endpoint. The annotation must be placed on the endpoint class, because the `SecurityIdentity` is created before the HTTP connection is upgraded to a WebSocket connection. For more information about the HTTP upgrade security, see the xref:websockets-next-reference.adoc#secure-http-upgrade[Secure HTTP upgrade] section of the Quarkus "WebSockets Next reference" guide.
ja_jp: `io.quarkus.oidc.Tenant` アノテーションを使用して、WebSockets Next サーバー・エンドポイントのテナントを選択できます。 `SecurityIdentity` は、HTTP 接続が WebSocket 接続にアップグレードされる前に作成されるため、アノテーションはエンドポイ ントクラスに配置する必要があります。 HTTP アップグレードのセキュリティの詳細については、Quarkus "WebSockets Next reference" ガイドの xref:websockets-next-reference.adoc#secure-http-upgrade[Secure HTTP upgrade] のセクションを参照してください。

source: The `io.quarkus.oidc.Tenant` annotation must be placed on either the resource class or resource method.
ja_jp: `io.quarkus.oidc.Tenant` アノテーションは、リソースクラスまたはリソースメソッドのいずれかに配置する必要があります。

source: The `io.quarkus.oidc.TokenIntrospection`, a simple `jakarta.json.JsonObject` wrapper object, will be created. It can be injected or accessed as a `SecurityIdentity` `introspection` attribute, providing either the JWT or opaque token has been successfully introspected.
ja_jp: `io.quarkus.oidc.TokenIntrospection` (シンプルな `jakarta.json.JsonObject` ラッパーオブジェクト) が作成されます。 このオブジェクトは、JWT または不透明トークンどちらかのイントロスペクションが成功した場合、 `SecurityIdentity` `introspection` 属性として注入またはアクセスできます。

source: The `io.quarkus.oidc.token.propagation.JsonWebTokenRequestFilter` provides the same functionality and, in addition, supports JWT tokens.
ja_jp: `io.quarkus.oidc.token.propagation.JsonWebTokenRequestFilter` は同じ機能を提供し、さらに JWT トークンもサポートします。

source: The `io.quarkus.qute.TemplateGlobal` annotation can be used to denote static fields and methods that supply _global variables_ which are accessible in any template.
ja_jp: アノテーション `io.quarkus.qute.TemplateGlobal` は、任意のテンプレートからアクセス可能な _グローバル変数_ を提供する静的フィールドとメソッドを示すために使用できます。

source: The `io.quarkus.qute.TemplateGlobal` annotation can be used to denote static fields and methods that supply _global variables_ which are accessible in any template. Internally, each global variable is added to the data map of any `TemplateInstance` via the `TemplateInstance#data(String, Object)` method.
ja_jp: `io.quarkus.qute.TemplateGlobal` アノテーションは、任意のテンプレートでアクセス可能な _グローバル変数_ を提供する静的フィールドとメソッドを示すために使用されます。内部的には、各グローバル変数は `TemplateInstance#data(String, Object)` メソッドを介して、任意の `TemplateInstance` のデータマップに追加されます。

source: The `io.quarkus.resteasy.reactive.jackson.SecureField.rolesAllowed` property supports xref:config-reference.adoc#property-expressions[property expressions] exactly in the same fashion the `jakarta.annotation.security.RolesAllowed` annotation does. For more information, please refer to the xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[Standard security annotations] section of the Authorization of web endpoints guide.
ja_jp: `io.quarkus.resteasy.reactive.jackson.SecureField.rolesAllowed` プロパティは、 `jakarta.annotation.security.RolesAllowed` アノテーションと同じ方法で、xref:config-reference.adoc#property-expressions[プロパティ式] をサポートします。 詳細は、xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[Web エンドポイントの認可ガイド] の「標準セキュリティアノテーション」セクションを参照してください。

source: The `io.quarkus.runtime.BlockingOperationControl#isBlockingAllowed()` method can be used to detect whether blocking is allowed on the current thread. When it is not, and you need to perform a blocking operation, you have to offload it to another thread. The easiest way is to use the `Vertx.executeBlocking()` method:
ja_jp: `io.quarkus.runtime.BlockingOperationControl#isBlockingAllowed()` メソッドを使用すると、現在のスレッドでブロッキングが許可されているかどうかを検出できます。 そうでない場合、ブロッキング操作を実行する必要がある場合は、その操作を別のスレッドにオフロードする必要があります。 最も簡単な方法は、 `Vertx.executeBlocking()` メソッドを使用することです。

source: The `io.quarkus.runtime.configuration.ConfigUtils.getProfiles` API provides a way to retrieve the active profiles programmatically.
ja_jp: `io.quarkus.runtime.configuration.ConfigUtils.getProfiles` API は、プログラムでアクティブなプロファイルを取得する方法を提供します。

source: The `io.quarkus.runtime.configuration.ProfileManager#getActiveProfile` API provides a way to retrieve the active profile programmatically.
ja_jp: `io.quarkus.runtime.configuration.ProfileManager#getActiveProfile` API は、プログラムでアクティブなプロファイルを取得する方法を提供します。

source: The `io.quarkus.security.Authenticated` annotation is added to the `hello()` method, which means that only authenticated users can access it.
ja_jp: `io.quarkus.security.Authenticated` アノテーションが `hello()` メソッドに追加されました。これにより、認証されたユーザーのみアクセス可能になります。

source: The `io.quarkus.test.junit.QuarkusMock` class can be used to temporarily mock out any normal scoped bean. If you use this method in a `@BeforeAll` method the mock will take effect for all tests on the current class, while if you use this in a test method the mock will only take effect for the duration of the current test.
ja_jp: `io.quarkus.test.junit.QuarkusMock` クラスは、通常のスコープ付きBeanを一時的にモックアウトするために使用することができます。 `@BeforeAll` メソッドでこのメソッドを使用した場合、モックは現在のクラスのすべてのテストに対して有効になりますが、test メソッドでこれを使用した場合、モックは現在のテストの間のみ有効になります。

source: The `io.quarkus.vertx.http.ManagementInterface` event is fired when the management interface is initialized. So, if the management interface is not enabled, the method won't be called.
ja_jp: `io.quarkus.vertx.http.ManagementInterface` イベントは、マネジメントインタフェースが初期化されたときに発生します。そのため、マネジメントインタフェースが有効になっていない場合は、このメソッドは呼び出されません。

source: The `io.quarkus.vertx.http.security.CORS` builder allows you to create a complete CORS configuration:
ja_jp: `io.quarkus.vertx.http.security.CORS` ビルダーを使用すると、完全な CORS 設定を作成できます。

source: The `io.quarkus.vertx.http.security.HttpSecurity` CDI event allows to configure the Basic authentication mechanism programmatically like in the example below:
ja_jp: `io.quarkus.vertx.http.security.HttpSecurity` CDI イベントにより、以下の例のように Basic 認証メカニズムをプログラムで設定できます。

source: The `io.quarkus.vertx.http.security.HttpSecurity` CDI event enable you to configuration the mutual TLS authentication programmatically like in the example below:
ja_jp: `io.quarkus.vertx.http.security.HttpSecurity` CDI イベントにより、以下の例のように相互 TLS 認証をプログラムで設定できます。

source: The `io.quarkus.websockets.next.WebSocketClientConnection` object represents the WebSocket connection. Quarkus provides a `@SessionScoped` CDI bean that implements this interface and can be injected in a `WebSocketClient` endpoint and used to interact with the connected server.
ja_jp: `io.quarkus.websockets.next.WebSocketClientConnection` オブジェクトは WebSocket 接続を表します。 Quarkus は、このインターフェイスを実装し、 `WebSocketClient` エンドポイントに注入して、接続されたサーバーと対話するために使用できる `@SessionScoped` CDI Bean を提供します。

source: The `io.quarkus.websockets.next.WebSocketConnection` object represents the WebSocket connection. Quarkus provides a `@SessionScoped` CDI bean that implements this interface and can be injected in a `WebSocket` endpoint and used to interact with the connected client.
ja_jp: `io.quarkus.websockets.next.WebSocketConnection` オブジェクトは WebSocket 接続を表します。 Quarkus は、このインターフェイスを実装し、 `WebSocket` エンドポイントに注入して、接続されたクライアントと対話するために使用できる `@SessionScoped` CDI Bean を提供します。

source: The `io.quarkus:quarkus-universe-bom` was still the default BOM in Quarkus 2.0.0.Final. As of Quarkus 2.1.0.Final, we recommend using the more granular, member-specific BOMs instead.
ja_jp: `io.quarkus:quarkus-universe-bom` は、Quarkus 2.0.0.FinalでもデフォルトのBOMでした。Quarkus 2.1.0.Finalでは、代わりに、より詳細なメンバー固有のBOMを使用することをお勧めします。

source: The `io.quarkus:quarkus-universe-bom`, as its artifactId implies, is certainly a large and diverse BOM, including dependencies of Camel, Google Cloud Services, Kogito, OptaPlanner and other Quarkus platform members. Importing `io.quarkus:quarkus-universe-bom` will enforce ~3600 dependency version constraints on an application.
ja_jp: `io.quarkus:quarkus-universe-bom` は、そのartifactIdが示すように、Camel、Google Cloud Services、Kogito、OptaPlanner、その他のQuarkusプラットフォームのメンバーの依存関係を含む、正に大規模で多様なBOMです。 `io.quarkus:quarkus-universe-bom` をインポートすると、アプリケーションに約3600の依存関係のバージョン制約が適用されます。

source: The `io.smallrye.config.ConfigSourceInterceptor` is able to intercept the resolution of a configuration name with the method `ConfigValue getValue(ConfigSourceInterceptorContext context, String name)`. The `ConfigSourceInterceptorContext` is used to proceed with the interceptor chain. The chain can be short-circuited by returning an instance of `io.smallrye.config.ConfigValue`. The `ConfigValue` objects hold information about the key name, value, config source origin and ordinal.
ja_jp: `io.smallrye.config.ConfigSourceInterceptor` は、メソッド `ConfigValue getValue(ConfigSourceInterceptorContext context, String name)` で設定名の解決をインターセプトすることができます。 `ConfigSourceInterceptorContext` は、インターセプター・チェーンを進めるために使用されます。このチェーンは、 `io.smallrye.config.ConfigValue` のインスタンスを返すことで短絡させることができます。 `ConfigValue` オブジェクトは、キー名、値、コンフィグソースのオリジン、序列に関する情報を保持しています。

source: The `io.smallrye.config.SmallRyeConfig#getProfiles` API provides a way to retrieve the active profiles programmatically.
ja_jp: `io.smallrye.config.SmallRyeConfig#getProfiles` API は、プログラムでアクティブなプロファイルを取得する方法を提供します。

source: The `io.smallrye.config.SmallRyeConfig` API allows to access the Config API programmatically. This API is mostly useful in situations where CDI injection is not available.
ja_jp: `io.smallrye.config.SmallRyeConfig` API を使用すると、プログラムで設定 API にアクセスできます。この API は、主に CDI インジェクションが利用できない状況で役立ちます。

source: The `io.smallrye.jwt.auth.principal.DefaultJWTCallerPrincipalFactory` is the default implementation used to parse and verify JWT tokens, converting them into `JsonWebToken` principals. This factory relies on the `MP JWT` and `smallrye-jwt` properties, as described in the `Configuration` section, to validate and customize JWT tokens.
ja_jp: `io.smallrye.jwt.auth.principal.DefaultJWTCallerPrincipalFactory` は、JWT トークンを解析および検証し、 `JsonWebToken` プリンシパルに変換するために使用されるデフォルトの実装です。このファクトリーは、 `Configuration` セクションで説明されているように、 `MP JWT` および `smallrye-jwt` プロパティーに依存して、JWT トークンを検証およびカスタマイズします。

source: The `io.smallrye.mutiny.vertx.core.ContextAwareScheduler` interface offers an API to obtain context-aware schedulers. Such a scheduler is configured with:
ja_jp: `io.smallrye.mutiny.vertx.core.ContextAwareScheduler` インターフェイスは、コンテキスト対応スケジューラーを取得するための API を提供します。 このようなスケジューラーは以下によって設定されます。

source: The `io.smallrye.reactive.messaging.annotations.Emitter`, `io.smallrye.reactive.messaging.annotations.Channel` and `io.smallrye.reactive.messaging.annotations.OnOverflow` classes are now deprecated and replaced by:
ja_jp: `io.smallrye.reactive.messaging.annotations.Emitter`、 `io.smallrye.reactive.messaging.annotations.Channel`、 `io.smallrye.reactive.messaging.annotations.OnOverflow` クラスは現在非推奨となっており、以下のように置き換えられています。

source: The `iss` claim is the issuer of the JWT. This needs to match the server side `mp.jwt.verify.issuer`. in order for the token to be accepted as valid.
ja_jp: `iss` クレームは JWT の発行者です。トークンが有効であると認められるためには、これがサーバー側の `mp.jwt.verify.issuer` と一致する必要があります。

source: The `issue-certificate` command currently creates a Let's Encrypt account automatically to simplify initial ACME setup. The TLS registry CLI continues to add more support for Let's Encrypt account management.
ja_jp: 初期の ACME セットアップを簡素化するために、 `issue-certificate` コマンドは現在 Let's Encrypt アカウントを自動的に作成します。TLS レジストリー CLI は、Let's Encrypt アカウント管理のサポートを継続的に追加しています。

source: The `item` parameter is automatically turned into a <<typesafe_expressions,parameter declaration>> and so all expressions that reference this name will be validated.
ja_jp: `item`パラメーターは自動的に <<typesafe_expressions,parameter declaration>> に変換されるので、この名前を参照するすべての式が検証されます。

source: The `item` parameter is automatically turned into a xref:typesafe_expressions[parameter declaration] and so all expressions that reference this name will be validated.
ja_jp: `item` パラメータは自動的に xref:typesafe_expressions[パラメータ宣言] となるため、この名前を参照するすべての式が検証されます。

source: The `jakarta.annotation.Priority` annotation overrides the `Converter` priority and change converters precedence to fine tune the execution order. By default, if no `@Priority` is specified by the `Converter`, the converter is registered with a priority of `100`. Consider:
ja_jp: `jakarta.annotation.Priority` アノテーションは、 `Converter` の優先順位を上書きし、コンバータの優先順位を変更して実行順序を微調整します。デフォルトでは、 `Converter` に `@Priority` が指定されていない場合、コンバーターは `100` の優先順位で登録されます。以下の場合、

source: The `jakarta.ws.rs.ext.Providers` is useful when we need to lookup the provider instances of the current client.
ja_jp: `jakarta.ws.rs.ext.Providers` は、現在のクライアントのプロバイダー・インスタンスを検索する必要がある場合に便利です。

source: The `javax.annotation.Priority` annotation overrides the `Converter` priority and change converters precedence to fine tune the execution order. By default, if no `@Priority` is specified by the `Converter`, the converter is registered with a priority of `100`. Consider:
ja_jp: `javax.annotation.Priority` アノテーションは、 `Converter` の優先順位を上書きし、コンバータの優先順位を変更して実行順序を微調整します。デフォルトでは、 `Converter` に `@Priority` が指定されていない場合、コンバーターは `100` の優先順位で登録されます。以下の場合、

source: The `javax.net.ssl` TLS configuration can be neither customized nor overridden.
ja_jp: `javax.net.ssl` TLS 設定は、カスタマイズもオーバーライドもできません。

source: The `javax.net.ssl` TLS configuration can not be customized or overridden.
ja_jp: `javax.net.ssl` TLS 設定はカスタマイズやオーバーライドができません。

source: The `javax.net.ssl` configuration can be used as a value for various `*.tls-configuration-name` properties, as shown below:
ja_jp: `javax.net.ssl` 設定は、以下に示すように、さまざまな `*.tls-configuration-name` プロパティーの値として使用できます。

source: The `jfr` CLI is a tool included in OpenJDK. The executable file is `$JAVA_HOME/bin/jfr`. We can use the jfr CLI to see a list of events limited to those related to Quarkus in the dump file by running the following command:
ja_jp: `jfr` CLI は OpenJDK に含まれるツールです。実行可能ファイルは `$JAVA_HOME/bin/jfr` です。 以下のコマンドを実行すると、jfr CLI を使用してダンプファイル内の Quarkus に関連するイベントに限定されたリストを表示できます。

source: The `k8s-sb` directory is the root of all service bindings. In this example, only one database called `fruit-db` is intended to be bound. This binding database has the `type` file, that indicates `postgresql` as the database type, while the other files in the directory provide the necessary information to establish the connection.
ja_jp: `k8s-sb` ディレクトリーは、すべてのサービスバインディングの root です。この例では、`fruit-db` と呼ばれる 1 つのデータベースのみをバインドすることを意図しています。このバインディングデータベースには、データベースタイプとして `postgresql` を示す `type` ファイルがあり、ディレクトリー内の他のファイルは、接続を確立するために必要な情報を提供します。

source: The `k` argument contains the cache key value.
ja_jp: `k` 引数には、キャッシュキーの値が含まれています。

source: The `key` group provides more fine-grain control on expiration and ttl of each key.
ja_jp: `key` グループは、各キーの有効期限や ttl をより細かく制御します。

source: The `key` param is set and so a different cached value is used for each result of the `{currentUser.username}` expression.
ja_jp: `key` パラメーターが設定されているため、`{currentUser.username}` の結果ごとに異なるキャッシュ値が使用されます。

source: The `kogito-quarkus-decisions` is a specialized extension of the Kogito project focusing only on DMN support; if you want to make use of the full capabilities offered by the Kogito platform, you can reference the generic Kogito extension of Quarkus.
ja_jp: `kogito-quarkus-decisions` は、Kogitoプロジェクトの中でもDMNのサポートのみに特化したエクステンションです。Kogitoプラットフォームが提供する機能をすべて利用したい場合は、Quarkusの汎用Kogitoエクステンションを参照することができます。

source: The `kotlin-maven-plugin` is configured as follows:
ja_jp: `kotlin-maven-plugin` は以下のように設定されています。

source: The `kotlin-stdlib-jdk8` is also added as a dependency.
ja_jp: `kotlin-stdlib-jdk8` も依存関係として追加されています。

source: The `lessonList` has an `@PlanningEntityCollectionProperty` annotation, so OptaPlanner can change them during solving and your `TimeTableConstraintProvider` can select _from_ those too.
ja_jp: `lessonList` には `@PlanningEntityCollectionProperty` アノテーションがあるため、OptaPlanner は解決中にそれらを変更でき、 `TimeTableConstraintProvider` はそれら_から_も選択できます。

source: The `list()` method might be surprising at first. It takes fragments of HQL (JP-QL) queries and contextualizes the rest. That makes for very concise but yet readable code.
ja_jp: `list()` メソッドには、最初は驚くかもしれません。これはHQL（JP-QL）クエリのフラグメントを取り、残りをコンテキスト化するものです。そのため、非常に簡潔で、しかも読みやすいコードになります。

source: The `log()` operator use the Quarkus logger;
ja_jp: `log()` オペレーターは、Quarkus のロガーを使用しています。

source: The `main` branch of the `quarkus` repository is synchronized daily at 1 AM GMT, so you cannot preview your changes on the link:https://quarkus.io/version/main/guides/[Main branch (SNAPSHOT)] until after the next site refresh occurs.
ja_jp: `quarkus` リポジトリの `main` ブランチは、毎日グリニッジ標準時の午前1時に同期されるため、次のサイト更新が行われるまで、 link:https://quarkus.io/version/main/guides/[Main ブランチ（SNAPSHOT] ）での変更をプレビューすることはできません。

source: The `main` branch of the `quarkus` repository is synchronized daily at 1AM GMT so you will not be able to preview your changes on link:https://quarkus.io/version/main/guides/[Main branch (SNAPSHOT)] until after the next site refresh occurs.
ja_jp: `quarkus` リポジトリの `main` ブランチは、毎日 GMT の午前 1 時に同期されるため、次のサイト更新が行われるまで、 link:https://quarkus.io/version/main/guides/[Main branch (SNAPSHOT)] での変更内容をプレビューすることはできません。

source: The `management` attribute is set to `true` to indicate that the injected URL is for the management interface. The `context-root` is automatically added. Thus, in the previous example, the injected URL is `http://localhost:9001/q/management`.
ja_jp: `management` 属性は `true` に設定され、注入された URL が管理インターフェイス用であることを示します。 `context-root` が自動的に追加されます。 したがって、前の例では、注入された URL は `http://localhost:9001/q/management` です。

source: The `mapTo` method uses the Quarkus Jackson mapper. Check xref:rest-json.adoc#json[this guide] to learn more about the mapper configuration.
ja_jp: `mapTo` メソッドは Quarkus Jackson マッパーを使用します。マッパーの設定について、詳しくは xref:rest-json.adoc#json[このガイド] を参照してください。

source: The `map` input parameter of the `hello` function would have the key value pairs: `a`->1, `b`->2.
ja_jp: `hello` Function の `map` 入力パラメーターは、 `a` →1, `b` →2 というキーバリューペアを持ちます。

source: The `march` parameter is only available on GraalVM 23+.
ja_jp: `march` パラメーターは GraalVM 23+ でのみ利用可能です。

source: The `max-lifetime` is disabled by default but is an important configuration when using a credentials provider that provides time limited credentials, like the xref:credentials-provider.adoc[Vault credentials provider].
ja_jp: `max-lifetime`はデフォルトでは無効になっていますが、 xref:credentials-provider.adoc[Vault 認証情報プロバイダー] のような時間制限のある認証情報を提供する認証情報プロバイダーを使用する場合に重要な設定です。

source: The `methods` - the HTTP verb triggering the route such as `GET`, `POST`...
ja_jp: `methods` - `GET`、 `POST` などのルートをトリガーする HTTP メソッド

source: The `methods` - the HTTP verbs triggering the route such as `GET`, `POST`...
ja_jp: `methods` - `GET`、 `POST` などのルートをトリガーする HTTP 動詞

source: The `mockableBean1` is configured here for every test method of the class
ja_jp: クラスのすべてのテストメソッドに対して `mockableBean1` が設定されています。

source: The `mp.jwt.verify.publickey` config property allows the Public Key text itself to be supplied as a string. The Public Key will be parsed from the supplied string in the order defined in section <<Supported Public Key Formats>>.
ja_jp: `mp.jwt.verify.publickey` 設定プロパティーを使用すると、公開鍵テキスト自体を文字列として提供できます。公開鍵は、<<Supported Public Key Formats>> セクションで定義された順序で、提供された文字列から解析されます。

source: The `mp.jwt.verify.publickey` config property allows the Public Key text itself to be supplied as a string. The Public Key will be parsed from the supplied string in the order defined in the xref:supported-public-key-formats[Supported Public Key Formats] section.
ja_jp: `mp.jwt.verify.publickey` 設定プロパティでは、公開鍵のテキストそのものを文字列として提供することができます。公開鍵は、 xref:supported-public-key-formats[サポートされる公開鍵の形式] セクションで定義された順序で、提供された文字列から解析されます。
